export type InfoType = {
    id: number;
    year: number;
    text: string;
}

export const dateInfo: InfoType[][] = [
    [
        {
            id: 1,
            year: 2015,
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
        {
            id: 2,
            year: 2016,
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
        {
            id: 3,
            year: 2017,
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
        {
            id: 4,
            year: 2018,
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
        {
            id: 5,
            year: 2019,
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
        {
            id: 6,
            year: 2020,
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
    ],
    [
        {
            id: 1,
            year: 1901,
            text: 'Одному из выдающихся исторических писателей, перу которого принадлежит такая монументальная работа, как «Римская история»'
        },
        {
            id: 2,
            year: 1902,
            text: 'За выдающиеся литературные добродетели, особенно же за высокий идеализм, а также за необыкновенное объединение душевности и таланта, о чём свидетельствуют его книги'
        },
        {
            id: 3,
            year: 1903,
            text: 'За свежесть и оригинальность поэтических произведений, которые правдиво отображают дух народа'
        },
        {
            id: 4,
            year: 1904,
            text: 'Фредерик Мистраль.За многочисленные заслуги в возрождении традиций испанской драмы'
        },
        {
            id: 5,
            year: 1905,
            text: 'Генрик Сенкевич. За выдающиеся заслуги в области эпоса'
        },
        {
            id: 6,
            year: 1906,
            text: 'Джозуэ Кардуччи. Не только за глубокие знания и критичный ум, а прежде всего за творческую энергию, свежесть стиля и лирическую силу, характерную для его поэтических шедевров'
        },
    ],
    [
        {
            id: 1,
            year: 1901,
            text: 'Вильгельм Конрад Рентгены. В знак признания исключительных услуг, которые он оказал науке открытием замечательных лучей, названных впоследствии в его честь'
        },
        {
            id: 2,
            year: 1902,
            text: 'Питер Зееман. В знак признания исключительных услуг, которые они оказали науке своими исследованиями влияния магнетизма на явления излучения'
        },
        {
            id: 3,
            year: 1903,
            text: 'Пьер Кюрри. В знак признания исключительных услуг, которые они оказали науке совместными исследованиями явлений радиации, открытой профессором Анри Беккерелем'
        },
        {
            id: 4,
            year: 1903,
            text: 'Мария Кюри. В знак признания исключительных услуг, которые они оказали науке совместными исследованиями явлений радиации, открытой профессором Анри Беккерелем'
        },
        {
            id: 5,
            year: 1921,
            text: 'Альберт Эйнштейн. За заслуги перед теоретической физикой и особенно за открытие закона фотоэлектрического эффекта'
        },
        {
            id: 6,
            year: 1924,
            text: 'Манне Сигбан. За открытия и исследования в области рентгеновской спектроскопии'
        },
    ],
    [
        {
            id: 1,
            year: 1958,
            text: 'Майкл Джо́зеф Дже́ксон. американский певец, автор песен, музыкальный продюсер, аранжировщик, танцор, хореограф, актёр'
        },
        {
            id: 2,
            year: 1983,
            text: 'Red Hot Chili Peppers. американская рок-группа, образованная в 1983 году в Калифорнии вокалистом Энтони Кидисом'
        },
        {
            id: 3,
            year: 1990,
            text: 'Madonna. американская автор-исполнительница, поп-певица, танцовщица, музыкальный продюсер, а также актриса, режиссёр и детская писательница'
        },
        {
            id: 4,
            year: 2008,
            text: 'Сте́фани Джоа́нн Анджели́на Джермано́тта. американская певица, автор песен, продюсер, филантроп, дизайнер и актриса.'
        },
        {
            id: 5,
            year: 2009,
            text: ' Жизе́ль Но́улз-Картер. американская певица в стиле R’n’B, актриса, танцовщица, музыкальный продюсер.'
        },
    ],
    [
        {
            id: 1,
            year: 2015,
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
        {
            id: 2,
            year: 2016,
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
        {
            id: 3,
            year: 2017,
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
        {
            id: 4,
            year: 2018,
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
        {
            id: 5,
            year: 2019,
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
        {
            id: 6,
            year: 2020,
            text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
        },
    ],
    ]

